Revit 2027 API
RebarCrankTypeUtils.GetAllRebarCrankTypes Method
 Gets all the Rebar Crank Types elements from the document.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<ElementId> GetAllRebarCrankTypes(
	Document document
)
Public Shared Function GetAllRebarCrankTypes (
	document As Document
) As IList(Of ElementId)
public:
static IList<ElementId^>^ GetAllRebarCrankTypes(
	Document^ document
)
static member GetAllRebarCrankTypes :
        document : Document -> IList<ElementId>
Parameters
document Document
 The document.
Return Value
IList<ElementId>
 Returns all the Rebar Crank Types elements from the document.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Internally this function is returning all element ids from a FilteredElementCollector of category BuiltInCategory.OST_RebarCrankType.
See Also
Reference
RebarCrankTypeUtils Class
Autodesk.Revit.DB.Structure Namespace